
// 2008

"kDiscoveringDevicesKey"					= "Searching for Bluetooth devices…";
"kDiscoveryCompleteKey"						= "Searching complete.";
"kBluetoothIsOffKey"						= "Bluetooth has been turned off on this computer. Once you have turned on Bluetooth, you may continue.";
"kErrorDiscoveringDevicesKey"				= "An error occurred while searching for devices.";

"kOptionsKey"								= "Options";
"kStopKey"									= "Stop";
"kStartKey"									= "Start";
"kShowKey"									= "Show";
"kAllDevicesKey"							= "All Devices";
"kLaptopsKey"								= "Laptops";
"kClearListKey"								= "Clear List";
"kAudioDevicesKey"							= "Audio Devices";

"kConfiguringServicesKey"					= "Configuring services";
"kPasskeySelectionKey"						= "Passkey Selection";
"kNumDevicesFoundKey"						= "Searching for devices - %@ found";
"kAutomaticPairAttemptKey"					= "The computer will attempt to automatically pair with your device.";

"kSpecifyDeviceKey"							= "Specify Device…";

"kDeviceList_MouseDevicesKey"				= "MICE";
"kDeviceList_KeyboardDevicesKey"			= "KEYBOARDS";
"kDeviceList_MobilePhoneDevicesKey"			= "MOBILE PHONES";
"kDeviceList_AudioDevicesKey"				= "AUDIO";
"kDeviceList_OtherDevicesKey"				= "OTHER";
"kDeviceList_ComputerDevicesKey"			= "COMPUTER";

"kDeviceList_NoDevicesFoundKey"				= "No Devices Found";

"kPair_Device_PairingAttemptFailedInvalidSoftwareKey"	= "The pairing attempt was unsuccessful. This configuration of Mac OS X and Bluetooth software could be invalid or unsupported.";
"kPairAttemptFailed3Key"								= "The pairing attempt was unsuccessful. If you would like to try a different passcode or pairing method, click “Passcode Options…” button. Click Continue to try again.";

"kAlreadyPairedWithThatDeviceTitleStringKey"			= "This computer is already paired with “%@.”";
"kAlreadyPairedWithThatDeviceExplanationStringKey"		= "Your computer is already paired with that device. Do you wish to remove the pairing and set up the device again?";

//============================== Pair Panel =============================//

"kPairingFailed"							= "Pairing Failed";

// === prior to 2008

// Panel Titles.

"kIntroductionKey"							= "Introduction";
"kSetupDecisionKey"							= "Select Device Type";
"kConclusionKey"							= "Conclusion";

"kKeyboardSetupTitleKey"					= "Bluetooth Keyboard Setup";
"kMouseSetupTitleKey"						= "Bluetooth Mouse Setup";
"kMouseTrackpadSetupTitleKey"				= "Bluetooth Mouse or Trackpad Setup";
"kDeviceSetupTitleKey"						= "Bluetooth Device Setup";
"kPhoneSetupTitleKey"						= "Bluetooth Mobile Phone Setup";
"kPrinterSetupTitleKey"						= "Bluetooth Printer Setup";
"kHeadsetSetupTitleKey"						= "Bluetooth Headset Setup";

// Misc stuff.

"kAreYouSureYouWantToQuitKey"				= "Are you sure you want to quit the Setup Assistant?";
"kAreYouSureYouWantToQuitExplanationKey"	= "You will have to run the Setup Assistant again from the beginning if you quit now.";
"kUsersKeyboardKey"							= "%@’s keyboard";
"kUsersMouseKey"							= "%@’s mouse";
"kUsersTrackpadKey"							= "%@’s trackpad";
"kRootUsersKeyboardKey"						= "admin’s keyboard";
"kRootUsersMouseKey"						= "admin’s mouse";

"kSetUpAnotherDeviceButtonKey"				= "Set Up Another Device";
"kAdvancedPasskeyOptionsButtonKey"			= "Passcode Options…";
"kOtherKey"									= "Other";
"kGenericKey"								= "Generic";

// Buttons.

"kOKButtonKey"								= "OK";
"kOpeniSyncButtonKey"						= "Open iSync";
"kCancelButtonKey"							= "Cancel";
"kContinueButtonKey"						= "Continue";
"kIgnoreButtonKey"							= "Ignore";
"kSkipButtonKey"							= "Skip";
"kQuitButtonKey"							= "Quit";
"kNeedAuthenticationTitleKey"				= "You must authenticate properly to make the changes you have specified.";
"kNeedAuthenticationExplanationKey"			= "To change the Internet access settings, you must authenticate as an administrator on this machine. Uncheck this setting or click Continue to try authenticating again.";

// Device types.

"kMobilePhoneCapsKey"						= "Mobile Phone";
"kMobilePhonesCapsKey"						= "Mobile Phones";
"kMobilePhoneKey"							= "mobile phone";
"kMobilePhonesKey"							= "mobile phones";
"kDeviceKey"								= "Device";
"kDevicesKey"								= "Devices";
"kMouseKey"									= "Mouse";
"kTrackpadKey"								= "Trackpad";
"kMiceKey"									= "Mice";
"kKeyboardKey"								= "Keyboard";
"kKeyboardsKey"								= "Keyboards";
"kPrinterKey"								= "Printer";
"kPrintersKey"								= "Printers";
"kHeadsetKey"								= "Headset";
"kHeadphonesKey"							= "Headphones";
"kHeadsetsKey"								= "Headsets";
"kComputerKey"								= "Computer";
"kComputersKey"								= "Computers";
"kPDAKey"									= "Handheld Device";
"kLANAccessPointKey"						= "LAN Access Point";
"kTypeKey"									= "Type";

// Services panel

"kServicesPanel_DeviceNameKey"				= "Device Name: ";
"kServicesPanel_DeviceAddressKey"			= "Device Address: ";
"kServicesPanel_DeviceTypeKey"				= "Device Type: ";
"kServicesPanel_DeviceServicesKey"			= "Device Services: ";

"kSetupServicesPanel_PhoneTitleKey"			= "Select the services you want to use with your mobile phone:";
"kSetupServicesPanel_DeviceTitleKey"		= "Select the services you want to use with your device:";

"kSetupServicesPanel_ConfiguringServicesKey"		=	"Configuring services…";

"kServicesPanel_GatheringInformationTitleKey"		=	"Gathering information about your device";
"kServicesPanel_GatheringInformationExplanationKey"	=	"The computer needs information about your device to determine how it can interact with it. This should only take a few seconds.";
"kServicesPanel_GatheringInformationUnknownErrorKey"=	"An unknown error has occurred while gathering information about your device. Make sure your device is in range of this computer, turned on and “discoverable.” When ready, click Continue to try again.";
"kServicesPanel_GatheringInformationSDPErrorKey"	=	"An error has occurred getting available services on your device. Make sure your device is in range of this computer, turned on and “discoverable.” When ready, click Continue to try again.";
"kServicesPanel_GatheringInformationStatusKey"		=	"Gathering additional information about your device…";
"kServicesPanel_GatheringInformationSuccessKey"		=	"Gathering additional information complete.";

// Intro Panel.

"kWelcomeToTheSetUpAssistantKey"			= "Welcome to the Bluetooth Setup Assistant.";
"kWelcomeMachineHasBluetoothKey"			= "When your device appears in the list, select it and click Continue. If you don’t see your device in the list, make sure it is powered on and “discoverable.” For more information, see the documentation that came with your device.";
"kWelcomeMachineDoesNotHaveBluetoothKey"	= "Appropriate Bluetooth hardware or software was not found on this computer. If you have recently installed Bluetooth hardware, check to ensure it is properly connected.\n\nOnce you have verified that your Bluetooth hardware is properly connected, you may continue.";

//============================== Discovery Panel =============================//

// Discovery Panel (General)

"kDiscovery_Gen_ErrorOccurredSearchingKey"					= "An error occurred attempting to perform the search.";
"kDiscovery_Gen_UpdatingDeviceNamesSingleKey"				= "Updating device name…";
"kDiscovery_Gen_UpdatingDeviceNamesMultipleKey"				= "Updating %@ device names…";

// Mouse HID (HIDless) panel

"kHIDLess_MouseInstructionTextKey"							= "There isn’t a mouse connected.";
"kHIDLess_MouseSmallInstructionTextKey"						= "Bluetooth Setup Assistant is looking for a Bluetooth mouse. If one is found it will be paired with your computer. Check your cables if you expect to use a USB mouse.\n\nIf you are attempting to use a Bluetooth mouse and it isn’t found, make sure it is turned on and “discoverable.” To turn on an Apple wireless mouse, slide the switch on the bottom of the mouse. If you are trying to use a non-Apple wireless mouse, see the documentation that came with the mouse.";
"kHIDLess_MouseAttemptingToConnectTextKey"					= "Attempting to connect with mouse #%@ (%@)…";
"kHIDLess_MouseClickContinueButtonTextKey"					= "Pairing was successful with a mouse. To acknowledge pairing, use your mouse to click Continue. If your mouse doesn't move the pointer and there is another wireless mouse available, then your computer may be trying to pair with the other mouse.\n\nThe Bluetooth Setup Assistant will attempt to pair again with your mouse in %@ seconds.";
"kHIDLess_MouseClickContinueButton2TextKey"					= "Pairing was successful with a mouse. To acknowledge pairing, use your mouse to click Continue. If your mouse doesn't move the pointer and there is another wireless mouse or trackpad available, then your computer may be trying to pair with another wireless mouse or trackpad.\n\nYour computer will attempt to pair again with your mouse in %@ seconds.";
"kHIDLess_MouseWaitingForPairingAckTextKey"					= "Click Continue (%@ seconds)…";
"kHIDLess_MousePairingFailed1TextKey"						= "The computer failed to pair with that mouse. The computer will try again with the same mouse in 5 seconds…";
"kHIDLess_MousePairingFailed2TextKey"						= "The computer failed to pair with that mouse. Pairing with the next wireless mouse or trackpad…";


// Mouse or Trackpad HID (HIDless) panel
"kHIDLess_MouseTrackpadInstructionTextKey"					= "There isn’t a wireless mouse or trackpad connected.";
"kHIDLess_MouseTrackpadSmallInstructionTextKey"				= "Looking for a wireless mouse or trackpad. If one is found it will be paired with your computer. Check your cables if you expect to use a USB mouse.\n\nIf you are attempting to use a wireless mouse or trackpad and it isn’t found, make sure it is turned on and “discoverable.” If you are using an Apple wireless mouse or trackpad, turn on your mouse or trackpad. If you are trying to use a non-Apple wireless mouse or trackpad, see the documentation that came with the mouse or trackpad.";
"kHIDLess_TrackpadAttemptingToConnectTextKey"				= "Attempting to connect with trackpad #%@ (%@)…";
"kHIDLess_TrackpadClickContinueButtonTextKey"				= "Pairing was successful with a trackpad. To acknowledge pairing, use your trackpad to click Continue. If your trackpad doesn't move the pointer and there is another wireless mouse or trackpad available, then your computer may be trying to pair with another wireless mouse or trackpad.\n\nYour computer will attempt to pair again with your trackpad in %@ seconds.";
"kHIDLess_TrackpadPairingFailed1TextKey"					= "The computer failed to pair with that trackpad. The computer will try again with the same trackpad in 5 seconds…";
"kHIDLess_TrackpadPairingFailed2TextKey"					= "The computer failed to pair with that trackpad. Pairing with the next wireless mouse or trackpad…";


// Keyboard HID (HIDless) panel

"kHIDLess_KeyboardInstructionTextKey"						= "There isn’t a wireless keyboard connected.";
"kHIDLess_KeyboardSmallInstructionDiscoveringTextKey"		= "Bluetooth Setup Assistant is looking for a Bluetooth keyboard. If one is found it will be paired with your computer. Check your cables if you expect to use a USB keyboard.\n\nIf you are attempting to use a Bluetooth keyboard and it isn’t found, make sure it is turned on and “discoverable.” If you are using an Apple wireless keyboard, turn on your keyboard. If you are trying to use a non-Apple wireless keyboard, see the documentation that came with the keyboard.";
"kHIDLess_KeyboardSmallInstructionDiscovering2TextKey"		= "Looking for a wireless keyboard. If one is found it will be paired with your computer. Check your cables if you expect to use a USB keyboard.\n\nIf you are attempting to use a wireless keyboard and it isn’t found, make sure it is turned on and “discoverable.” If you are using an Apple wireless keyboard, turn on your keyboard. If you are trying to use a non-Apple wireless keyboard, see the documentation that came with the keyboard.";
"kHIDLess_KeyboardSmallInstructionPairingTextKey"			= "Type the following passkey on the keyboard you are setting up, followed by the Return key:\n\n\n\n\n\nOnce you have entered the passkey on your keyboard, the pairing process is complete.";
"kHIDLess_KeyboardAttemptingToConnectTextKey"				= "Attempting to connect to keyboard #%@ (%@)…";
"kHIDLess_KeyboardConnectedTextKey"							= "Connection established with keyboard #%@ (%@).";
"kHIDLess_KeyboardTypeContinueButtonTextKey"				= "Pairing with your keyboard was successful.\n\nType the Return key on your keyboard when you are ready to continue.";
"kHIDLess_KeyboardPairingAuthenticationFailedTextKey"		= "An authentication error occurred. The passcodes did not match.";
"kHIDLess_KeyboardPairingTimeoutTextKey"					= "A connection timeout error occurred. Make sure you type the passcode and press the Return key.";
"kHIDLess_KeyboardPairingAuthenticationFailed2TextKey"		= "The computer failed to pair with that keyboard. The computer will try again with the same keyboard in 5 seconds…";
"kHIDLess_KeyboardPairingFailedTextKey"						= "The computer failed to pair with that keyboard. The computer will try again in 5 seconds…";

//============================== Pair Panel =============================//

"kDiscovery_Device_YouMustFindAndSelectBeforeContinuingKey"	= "You must find and select a device in the list before continuing.";
"kDiscovery_Device_NoDeviceSelectedKey"						= "No device selected.";

"kPair_Mouse_PairingAttemptSucceededKey"		= "This computer and the mouse have been successfully paired.";
"kPair_Trackpad_PairingAttemptSucceededKey"		= "This computer and the trackpad have been successfully paired.";
"kPair_Keyboard_PairingAttemptSucceededKey"		= "This computer and the keyboard have been successfully paired.";

// Pair Panel (General).

"kPair_General_NoDeviceStringKey"				= "Error: No device has been specified on the previous panel.";
"kPair_General_PairingAttemptToPairKey"			= "Attempting to pair with “%@”.";
"kPair_General_ConnectingToDeviceKey"			= "Connecting to “%@”.";
"kPair_General_ConnectionEstablishedKey"		= "Connection established.";

// Discovery Panel (mice)

"kDiscovery_Mouse_SearchingForDevicesKey"					= "Searching for mice - %@ found.";
"kDiscovery_Mouse_YouMustFindAndSelectBeforeContinuingKey"	= "You must find and select a mouse in the list before continuing.";
"kDiscovery_Mouse_NoDeviceSelectedKey"						= "No mouse selected.";
"kDiscovery_Mouse_SmallInstructionTextKey"					= "When your mouse appears in the list, select it and click Continue. If you don’t see your mouse in the list, make sure your mouse is “discoverable.” If you are using an Apple wireless mouse, slide the switch on the bottom of the mouse to turn it on.";
"kDiscovery_Mouse_NoFoundDevicesSoFarKey"					= "No mice have been found. Make sure your mouse is “discoverable.”";
"kDiscovery_Mouse_BigInstructionTextKey"					= "Searching for your mouse";

// Discovery Panel (mice/trackpads)
"kDiscovery_Mouse_Trackpad_SearchingForDevicesKey"			= "Searching for wireless mice or trackpads - %@ found.";
"kDiscovery_Mouse_Trackpad_NoFoundDevicesSoFarKey"			= "No wireless mice or trackpads have been found. Make sure your wireless mouse or trackpad is “discoverable.”";


// Discovery Panel (keyboards)

"kDiscovery_Keyboard_SearchingForDevicesKey"					= "Searching for keyboards - %@ found.";
"kDiscovery_Keyboard_YouMustFindAndSelectBeforeContinuingKey"	= "You must find and select a keyboard in the list before continuing.";
"kDiscovery_Keyboard_NoDeviceSelectedKey"						= "No keyboard selected.";
"kDiscovery_Keyboard_SmallInstructionTextKey"					= "When your keyboard appears in the list, select it and click Continue. If you don’t see your keyboard in the list, make sure your keyboard is “discoverable.” If you are using an Apple wireless keyboard, turn on your keyboard.";
"kDiscovery_Keyboard_NoFoundDevicesSoFarKey"					= "No keyboards have been found. Make sure your keyboard is “discoverable.”";
"kDiscovery_Keyboard_BigInstructionTextKey"						= "Searching for your keyboard";


// Pair Panel (SSP Numeric Comparison).

"kPair_SSPNumCmp_StatusExplanationTextKey"		= "To continue pairing, make sure the number below is displayed on the device you’re pairing.";
"kPair_SSPNumCmp_StatusTextKey"					= "If you see this number on the other device, click Continue to complete the pairing process. If you don’t, click Go Back to try again.";

// Pair Panel (SSP Passkey Notification).

"kPair_SSPPassNotif_StatusExplanationTextKey"	= "To continue pairing, type the number below followed by the Return key on the device you’re pairing.";

// Pair Panel (Other Devices).

"kPair_Device_BigTitleTextKey"					= "Pairing with your Bluetooth device";
"kPair_Device_InstructionTextKey"				= "Your device may ask you to enter a passkey. Check your device to see if it is ready to accept a passkey. When your device is ready, enter in the following passkey:\n\n\n\n\nOnce you have entered the passkey on your device the pairing process will be completed.";
"kPair_Device_ClickContinueToSetupKey"			= "Click Continue to set up the services available on your device.";
"kPair_Device_PairingAttemptFailed1Key"			= "Unable to pair with your device. Click Continue to try again.";
"kPair_Device_PairingAttemptFailed2Key"			= "The pairing attempt was unsuccessful. Make sure your device is in range of this computer, turned on and “discoverable.” When ready, click Continue to try again.";
"kPair_Device_PairingAttemptFailed3Key"			= "The pairing attempt was unsuccessful. If using a passcode, make sure you are entering it properly on your device. When ready, click Continue to try again.";
"kPair_Device_PairingAttemptFailed18Key"		= "The pairing attempt was unsuccessful. The device is refusing the pairing attempt. Refer to the manual that came with the device. When ready, click Continue to try again.";
"kPair_Device_PairingAttemptSucceededKey"		= "This computer and the device have been successfully paired.";
"kPair_Device_AlreadyPairedKey"					= "This computer and the device are already paired.";
"kPair_Device_GatheringServiceInformationKey"	= "Collecting service information about your device.";
"kPair_Device_GatheringInformationKey"			= "Gathering additional information about your device.";
"kPair_Device_EmptyPasskeyInstructionTextKey"	= "The computer will use an empty passkey to pair with your device.";

//============================== Dial up Panel =============================//

"kDialupErrorSavingNetworkTitleTextKey"			= "Failed to save the network settings.";
"kDialupErrorSavingNetworkExplanationTextKey"	= "The bluetooth network settings could not be saved.";
"kDialupErrorSavingSerialTitleTextKey"			= "Failed to save the network settings.";
"kDialupErrorSavingSerialExplanationTextKey" 	= "The network configuration changes could not be saved.";

//============================== Internet Access Panel =============================//

"kInternetAccess_InstructionTitleKey"				= "To access the Internet using your device, you need to provide the following information.";
"kInternetAccess_UserNameTextFieldLabelKey"			= "Username:";
"kInternetAccess_PasswordTextFieldLabelKey"			= "Password:";
"kInternetAccess_APNTextFieldLabelKey"				= "APN:";
"kInternetAccess_PhoneNumberTextFieldLabelKey"		= "Phone Number:";
"kInternetAccess_GPRSExampleKey"					= "For example, *99*123456789#";
"kInternetAccess_NoBluetoothNetworkInterfaceKey"	= "Bluetooth Setup Assistant can’t set up your device as a dial-up modem because the Bluetooth interface isn’t available. Open Network preferences to add it.";

//============================== conclusion Panel =============================//

"kCheckMarkCharacterKey"							= "√";
"kBulletCharacterKey"								= "•";
"kConclusionPanelUseISyncKey"						= "Use iSync to transfer contacts and events";
"kConclusionPanelUseFileTransferKey"				= "Use to transfer files";
"kConclusionPanelUseAddressBookKey"					= "Use with Address Book";
"kConclusionPanelUseAsHIDDeviceKey"					= "Use as an input device for this computer";
"kConclusionPanelUseInternetKey"					= "Access the Internet";
"kConclusionPanelUseSerialPortKey"					= "A computer serial port was created";
"kConclusionPanelUseAsPANDeviceKey"					= "Use as a Personal Area Network";
"kConclusionPanelUseAsAudioOutputKey"				= "Use as an audio output device";
"kConclusionPanelUseAsAudioInputKey"				= "Use as an audio input device";
"kConclusionPanelDevicePairedKey"					= "Pairing was completed successfully";
"kConclusionPanelNoSupportedServicesWereFoundKey"	= "There were no supported services found on this device.";
"kConclusionPanelFailedNoServicesTitleKey"			= "Your Bluetooth device was not setup with your computer.";

//============================== General conclusion Panel =============================//

"kConclusionPanelPhoneSummaryTitleKey"		= "Your computer and mobile phone are setup as follows:";
"kConclusionPanelDeviceSummaryTitleKey"		= "Your computer and device are setup as follows:";

"kConclusionPanelMobilePhoneSetupKey"		= "Congratulations! Your mobile phone is now setup to use your computer’s Bluetooth features.";
"kConclusionPanelKeyboardSetupKey"			= "Congratulations! Your computer is now set up to use your Bluetooth keyboard.";
"kConclusionPanelMouseSetupKey"				= "Congratulations! Your computer is now set up to use your Bluetooth mouse.";
"kConclusionPanelTrackpadSetupKey"			= "Congratulations! Your computer is now set up to use your Bluetooth trackpad.";	
"kConclusionPanelOtherDeviceKey"			= "Congratulations! Your computer is now set up to use your Bluetooth device.";
"kConclusionPanelKeyboardAndMouseKey"		= "Congratulations! Your computer is now set up to use your Bluetooth keyboard and mouse.";
"kConclusionPanelPrinterSetupKey"			= "Congratulations! Your computer is now set up to use your Bluetooth printer.";
"kConclusionPanelHeadsetSetupKey"			= "Congratulations! Your computer is now set up to use your Bluetooth headset.";
"kConclusionPanelAppleHeadsetSetupKey"		= "Congratulations! Your computer is now set up to use your iPhone Bluetooth Headset.";
"kConclusionPanelAppleiPhoneSetupKey"		= "Congratulations! Your computer is now set up to use your iPhone.";
"kConclusionPanelMouseSetupSkippedKey"		= "There is a mouse connected to this computer. Setting up a Bluetooth connection is no longer necessary.";
"kConclusionPanelMouseTrackpadSetupSkippedKey"	= "There is a mouse connected to this computer. Setting up a Bluetooth mouse or trackpad is no longer necessary.";
"kConclusionPanelKeyboardSetupSkippedKey"	= "There is a keyboard connected to this computer. Setting up a Bluetooth connection is no longer necessary.";
"kConclusionPanelSetupInterruptedKey"		= "The device set up process was interrupted.";
"kConclusionPanelHeadsetsNotSupportedKey"	= "The Setup assistant failed to configure the headset. Try setting it up again.";
"kConclusionPanelFailedSetupErrorKey"		= "An error occurred while setting your device (0x%x). Try setting it up again.";
"kConclusionPanelFailedNoServicesTextKey"	= "There were no configurable services found on your device. This could be due to services not being enabled on the device, or the device might not have any services that need to be configured with the computer. See the documentation that came with your device for more information.";
"kConclusionPanelNoServicesConfiguredTextKey"	= "None of the available services were configured for your Bluetooth device.";
"kConclusionPanelUseAssistantAgainToChangeKey"	= "Use this Setup Assistant again if you want to change any of these settings.";


